Revit 2026 API

# TopographyEditScope Class

---

A TopographyEditScope allows an application to create and maintain an editing session for a TopographySurface.

SystemObject Autodesk.Revit.DBEditScope Autodesk.Revit.DB.ArchitectureTopographyEditScope

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TopographyEditScope : EditScope
```
```vb
Public Class TopographyEditScope
	Inherits EditScope
```
```cpp
public ref class TopographyEditScope : public EditScope
```
```fsharp
type TopographyEditScope =
    class
        inherit EditScope
    end
```

The TopographyEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TopographyEditScope | Instantiates a TopographyEditScope object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. (Inherited from EditScope) |
|  | IsPermitted | Tells if the edit scope is permitted to start. (Inherited from EditScope) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from EditScope) |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. (Inherited from EditScope) |
|  | Commit | Finishes the edit scope. (Inherited from EditScope) |
|  | Dispose | (Inherited from EditScope) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Start | Starts a topography surface edit mode for an existing TopographySurface element. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Start/end of a TopographyEditScope will start/end a transaction group. After a TopographyEditScope is started, an application can start transactions and edit the topography surface. Individual transactions the application creates inside TopographyEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into TopographyEditScope constructor.

#### Reference

Autodesk.Revit.DB.Architecture Namespace